{
  "country" : [
  {
    "g": "中国",
    "l": [
      {
        "p": "北京",
        "c": [{
          "n": "东城区"
        }, {
          "n": "西城区"
        }]
      },{
        "p": "天津",
        "c": [{
          "n": "和平区"
        }, {
          "n": "河东区"
        }, {
          "n": "河西区"
        }, {
          "n": "南开区"
        }, {
          "n": "河北区"
        }]
      },{
        "p": "河北",
        "c": [{
          "n": "石家庄",
          "a": [{
            "s": "长安区"
          }, {
            "s": "桥东区"
          }, {
            "s": "桥西区"
          }, {
            "s": "新华区"
          }]
        },{
          "n": "唐山",
          "a": [{
            "s": "路南区"
          }, {
            "s": "路北区"
          }, {
            "s": "古冶区"
          }, {
            "s": "开平区"
          }, {
            "s": "丰南区"
          }]
        }]
      }
    ]
  },
  {
    "g": "韩国",
    "l": [
      {
        "p": "首尔",
        "c": [{
          "n": "江南区"
        }, {
          "n": "道峰区"
        }, {
          "n": "江东区"
        }]
      },{
        "p": "釜山直辖市",
        "c": [{
          "n": "和平区"
        }, {
          "n": "河东区"
        }, {
          "n": "河西区"
        }, {
          "n": "南开区"
        }, {
          "n": "河北区"
        }]
      }
    ]
  },
  {
    "g": "美国",
    "l": [
      {
        "p": "加利福尼亚州",
        "c": [{
          "n": "洛杉矶",
          "a": [{
            "s": "大洛杉矶郡"
          }, {
            "s": "橙郡"
          }, {
            "s": "洛杉矶都会区"
          }]
        },{
          "n": "旧金山",
          "a": [{
            "s": "路南区"
          }, {
            "s": "路北区"
          }, {
            "s": "古冶区"
          }]
        }]
      },
      {
        "p": "加利福尼亚州s",
        "c": [{
          "n": "洛杉矶s",
          "a": [{
            "s": "大洛杉矶郡s"
          }, {
            "s": "橙郡s"
          }, {
            "s": "洛杉矶都会区"
          }]
        },{
          "n": "旧金山s",
          "a": [{
            "s": "路南区s"
          }, {
            "s": "路北区"
          }, {
            "s": "古冶区"
          }]
        }]
      }
    ]
  }
  ]
}